app/controllers/movies_controller.rb

  def show
    render json: Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def create
    # @movie = Movie.new(movie_params)
    @movie = current_user.movies.build(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("name", "year_released", "mpaa_rating", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "example"], ["year_released", 2], ["mpaa_rating", "2"], ["user_id", 32], ["created_at", 2017-05-08 18:44:09 UTC], ["updated_at", 2017-05-08 18:44:09 UTC]]

  def update
    if @movie.update(movie_params)
---
UPDATE "movies" SET "last_viewing" = $1, "times_watched" = $2, "updated_at" = $3 WHERE "movies"."id" = $4  [["last_viewing", Mon, 01 May 2017], ["times_watched", 50], ["updated_at", 2017-05-08 20:06:55 UTC], ["id", 54]]

    def set_movie
      # @movie = Movie.find(params[:id])
      # validate_user
      @movie = current_user.movies.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."user_id" = $1 AND "movies"."id" = $2 LIMIT $3  [["user_id", 32], ["id", 10], ["LIMIT", 1]]